Repository: openstack-archive/deb-designate
Catalog: designate/locale/*/LC_MESSAGES/designate-log-error.po
Languages: fr, pt_br

source: Failed to deserialize packet from %(host)s:%(port)d
fr: N'a pas pu dé-sérialiser le paquet de %(host)s:%(port)d
pt_br: Falha ao deserializar pacote do %(host)s:%(port)d

source: Unhandled exception while processing request from %(host)s:%(port)d
fr: Exception non prise en charge lors du traitement d'une requête en provenance de %(host)s:%(port)d
pt_br: Exception não-tratada enquanto processando requisição do %(host)s:%(port)d

source: Missing context in request, please check.
fr: Contexte manquant dans la requête. Veuillez vérifier.
pt_br: Faltando contexto na requisição, por favor verifique.

source: Error: could not authenticate to IPA - please check for correct keytab file
fr: Erreur : impossible d'authentifier dans IPA - veuillez vérifier que vous avez le fichier keytab qui convient
pt_br: Erro: não foi possível autenticar no IPA - por favor, verifique para corrigir o arquivo do keytab

source: caught kerberos exception %r
fr: exception kerberos interceptée %r
pt_br: Capturada exceção do kerberos %r

source: Number of errors: %d
fr: Nombre d'erreurs : %d
pt_br: Número de erros: %d

source: Error Lines: %s
fr: Lignes d'erreurs : %s
pt_br: Linhas de erros: %s

source: got exception while handling axfr request. Question is %(qr)s
fr: exception apparue lors du traitement des requêtes axfr La question est %(qr)s
pt_br: obtida exceção enquanto processando requisição axfr. Questão é %(qr)s

source: Failed calling Neutron %(region)s - %(endpoint)s
fr: Échec de l'appel Neutron %(region)s - %(endpoint)s
pt_br: Falha ao chamar Neutron %(region)s - %(endpoint)s

source: in fixed duration looping call
fr: en appel en boucle à durée fixe
pt_br: em chamada de duração fixa de loop

source: in dynamic looping call
fr: en appel en boucle dynamique
pt_br: em chamada de loop dinâmico

source: Failed to understand rule %s
fr: N'a pas compris la règle %s
pt_br: Falha ao entender regra %s

source: No handler for matches of kind %s
fr: Aucun gestionnaire pour ce type de correspondance %s
pt_br: Nenhum manipulador para correspondências do tipo %s

source: Unhandled exception
fr: Exception non prise en charge
pt_br: Exceção não-tratada
