Repository: openstack-archive/deb-designate
Catalog: designate/locale/*/LC_MESSAGES/designate-log-warning.po
Languages: fr

source: Request authorized to bypass maintenance mode
fr: Requête non assujettie au mode de maintenance

source: Failed to delete domain '%(domain)s' during sync. Message: %(message)s
fr: N'a pas pu supprimer le domaine '%(domain)s' pendant la sync. Message : %(message)s

source: Failed to delete record '%(record)s' in domain '%(domain)s' during sync. Message: %(message)s
fr: N'a pas pu supprimer l'enregistrement '%(record)s' dans le domaine '%(domain)s' pendant la sync. Message : %(message)s

source: Attempt to delete %(d_id)s / %(d_name)s caused 404, ignoring.
fr: Tentative de suppression des %(d_id)s / %(d_name)s entraînant l'erreur 404, ignore.

source: No IPA client kerberos keytab file given
fr: Aucun fichier keytab de kerberos de client IPA donné

source: **** A manual post-migration step is required ****
fr: **** Étape manuelle de post-migration requise ****

source: Please issue this query: %s
fr: Veuillez lancer cette demande : %s

source: Handling TCP Request from: %(host)s:%(port)d
fr: Traitement de la requête TCP en provenance de : %(host)s:%(port)d

source: Handling UDP Request from: %(host)s:%(port)d
fr: Traitement de la requête UDP de: %(host)s:%(port)d

source: Calling Neutron resulted in a 401, please investigate.
fr: L'appel à Neutron s'est traduit par un 401, veuillez procéder à des investigations.

source: task %(func_name)s run outlasted interval by %(delay).2f sec
fr: la tâche %(func_name)s a dépassé l'intervalle de %(delay).2f sec

source: pid %d not in child list
fr: pid %d ne fait pas partie de la liste enfant

source: No designate-sink handlers enabled or loaded
fr: Aucun gestionnaire designate-sink n'a été activé ou téléchargé

source: Id not in sort_keys; is sort_keys unique?
fr: Id ne se trouve pas dans sort_keys; est-ce que sort_keys est unique ?
