Repository: openstack-archive/deb-designate
Catalog: debian/po/*.po
Languages: de, pt

source: Set up a database for Designate?
de: Eine Datenbank für Designate einrichten?
pt: Configurar uma base de dados para o Designate?

source: No database has been set up for designate to use. Before continuing, you should make sure you have the following information:
de: Für die Verwendung mit Designate wurde noch keine Datenbank eingerichtet. Bevor Sie fortfahren, sollen Sie sicherstellen, dass Sie über die folgenden Informationen verfügen:
pt: Nenhuma base de dados foi configurada para o designate utilizar. Antes de continuar, deve certificar-se que tem a seguinte informação:

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
de: * die Art der Datenbank, die Sie verwenden möchten * den Rechnernamen des Datenbankservers (dieser Server muss TCP-Verbindungen von dieser Maschine erlauben) * einen Benutzernamen und ein Passwort zum Zugriff auf die Datenbank
pt: * o tipo de base de dados que deseja usar; * o nome de máquina do servidor da base de dados (esse servidor deve permitir ligações TCP a partir desta máquina); * um nome de utilizador e palavra passe para acesso à base de dados.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
de: Falls Teile dieser Anforderungen fehlen, wählen Sie diese Option nicht aus und verwenden Sie die normale SQLite-Unterstützung.
pt: Se algum deste requerimentos estiver em falta, não escolha esta opção e corra com suporte SQLite regular.

source: You can change this setting later on by running "dpkg-reconfigure -plow designate-common".
de: Sie können diese Einstellung später ändern, indem Sie »dpkg-reconfigure -plow designate-common« ausführen.
pt: Você pode alterar esta definição mais tarde ao correr "dpkg-reconfigure -plow designate-common".

source: Authentication server hostname:
de: Rechnername des Authentifizierungs-Servers:
pt: Nome de máquina do servidor de autenticação:

source: Please specify the hostname of the authentication server for Designate. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
de: Bitte geben Sie den Rechnernamen des Authentifizierungs-Servers für Designate an. Typischerweise ist dies auch der Rechnername des OpenStack-Identitätsdienstes (Keystone).
pt: Por favor especifique o nome de máquina do servidor de autenticação para o Designate. Tipicamente este é também o nome de máquina do Serviço de Identidade OpenStack (Keystone).

source: Authentication server tenant name:
de: Tenant-Name des Authentifizierungs-Servers:
pt: Nome tenant do servidor de autenticação:

source: Please specify the authentication server tenant name.
de: Bitte geben Sie den Tenant-Namen des Authentifizierungs-Servers an.
pt: Por favor especifique o nome tenant do servidor de autenticação.

source: Authentication server username:
de: Benutzername des Authentifizierungs-Servers:
pt: Nome de utilizador do servidor de autenticação:

source: Please specify the username to use with the authentication server.
de: Bitte geben Sie den Benutzernamen an, der mit dem Authentifizierungs-Server verwandt werden soll.
pt: Por favor especifique o nome de utilizador a usar com o servidor de autenticação.

source: Authentication server password:
de: Passwort des Authentifizierungs-Servers:
pt: Palavra passe do servidor de autenticação:

source: Please specify the password to use with the authentication server.
de: Bitte geben Sie das Passwort an, das mit dem Authentifizierungs-Server verwandt werden soll.
pt: Por favor especifique a palavra passe a usar com o servidor de autenticação:

source: IP address of your RabbitMQ host:
de: IP-Adresse Ihres RabbitMQ-Rechners:
pt: Endereço IP da sua máquina RabbitMQ:

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
de: Um mit anderen Komponenten von OpenStack zusammenzuarbeiten muss sich dieses Paket mit einem zentralen RabbitMQ-Server verbinden.
pt: De modo a inter-operar com outros componentes do OpenStack, este pacote precisa de se ligar a um servidor RabbitMQ central.

source: Please specify the IP address of that server.
de: Bitte geben Sie die IP-Adresse dieses Servers an.
pt: Por favor especifique o endereço IP desse servidor.

source: Username for connection to the RabbitMQ server:
de: Benutzername für Verbindungen mit dem RabbitMQ-Server:
pt: Nome de utilizador para ligação ao servidor RabbitMQ:

source: Please specify the username used to connect to the RabbitMQ server.
de: Bitte geben Sie den Benutzernamen für Verbindungen mit dem RabbitMQ-Server an.
pt: Por favor especifique o nome de utilizador usado para ligar ao servidor RabbitMQ.

source: Password for connection to the RabbitMQ server:
de: Passwort für Verbindungen mit dem RabbitMQ-Server:
pt: Palavra passe para ligação ao servidor RabbitMQ:

source: Please specify the password used to connect to the RabbitMQ server.
de: Bitte geben Sie das Passwort für Verbindungen mit dem RabbitMQ-Server an.
pt: Por favor especifique a palavra passe usada para ligar ao servidor RabbitMQ.

source: Register Designate in the Keystone endpoint catalog?
de: Designate im Keystone-Endpoint-Katalog registrieren?
pt: Registar o Designate no catálogo de endpoint do Keystone?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
de: Jeder OpenStack-Dienst (jedes API) sollte registriert werden, um zugreifbar zu sein. Dies erfolgt mittels »keystone service-create« und »keystone endpoint-create«. Das kann jetzt automatisch erfolgen.
pt: Cada serviço do OpenStack (cada API) deve ser registado de modo a ser acessível. Isto é feito usando "keystone service-create" e "keystone endpoint-create". Isto pode ser feito agora automaticamente.

source: Note that you will need to have an up and running Keystone server on which to connect using the Keystone authentication token.
de: Beachten Sie, dass ein laufender Keystone-Server benötigt wird, bei dem Sie sich mit einem Keystone-Authentifizierungs-Token verbinden können.
pt: Note que você irá precisar de ter um servidor Keystone pronto e a correr no qual se ligar usando o símbolo de autenticação Keystone.

source: Keystone server IP address:
de: IP-Adresse des Keystone-Servers:
pt: Endereço IP do servidor Keystone:

source: Please enter the IP address of the Keystone server, so that designate-api can contact Keystone to do the Designate service and endpoint creation.
de: Bitte geben Sie die IP-Adresse des Keystone-Servers ein, so dass sich Designate-api mit dem Keystone verbinden kann, um die Erstellung der Designate-Dienste und -Endpunkte vorzunehmen.
pt: Por favor indique o endereço IP do servidor Keystone, para que designate-api possa contactar o Keystone para fazer o serviço Designate e a criação do endpoint.

source: Keystone authentication token:
de: Keystone-Authentifizierungs-Token:
pt: Símbolo de autenticação do Keystone:

source: To configure its endpoint in Keystone, designate-api needs the Keystone authentication token.
de: Um seine Endpunkte in Keystone zu konfigurieren, benötigt Designate-Api den Keystone-Authentifizierungs-Token.
pt: Para configurar o seu endpoint no Keystone, o designate-api precisa do símbolo de autenticação do Keystone.

source: Designate endpoint IP address:
de: IP-Adresse des Designate-Endpoints
pt: Endereço IP do endpoint do Designate:

source: Please enter the IP address that will be used to contact Designate.
de: Bitte geben Sie die IP-Adresse ein, die für Verbindungen mit Designate verwandt werden wird.
pt: Por favor indique o endereço IP que será usado para contactar o Designate.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
de: Diese IP-Adresse sollte von den Clients, die diesen Dienst nutzen werden, zugreifbar sein. Installieren Sie daher eine öffentliche Cloud, dann sollte dieses eine öffentliche IP-Adresse sein.
pt: Este endereço IP deve ser acessível a partir dos clientes que irão usar este serviço, portanto se você está a instalar uma cloud pública, este deve ser um endereço IP público.

source: Name of the region to register:
de: Name der zu registrierenden Region:
pt: Nome da região a registar:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
de: OpenStack unterstützt die Verwendung von Verfügbarkeitszonen, wobei jede Region einen Ort darstellt. Bitte geben Sie die Zone ein, die Sie bei der Registrierung des Endpunkts verwenden möchten.
pt: O OpenStack suporta a utilização de zonas de disponibilidade, com cada região a representar uma localização. Por favor indique a zona que deseja usar quando registar o endpoint.
